Revit 2021.1 API
UnitFormatUtils.Format Method
Overload List
Name | Description
Format(Units, ForgeTypeId, Double, Boolean)
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean) |  Obsolete.
 Formats a number with units into a string.
Format(Units, ForgeTypeId, Double, Boolean, FormatValueOptions)
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean, FormatValueOptions) |  Obsolete.
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean, Boolean) |  Obsolete.
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean, Boolean, FormatValueOptions) |  Obsolete.
 Formats a number with units into a string.
See Also
UnitFormatUtils Class
UnitFormatUtils Members
Autodesk.Revit.DB Namespace